code-review/NRB_3471_3546/База_Было/AccumulationRegisters/НалоговаяБазаВыплатыДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>НалоговаяБазаВыплатыДоходов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНалогаСПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗачетНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗачетНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКВыплатеПоОсновнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКВыплатеПоПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОкругленияНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮридическиеФизическиеЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/AccumulationRegisters/НалоговаяБазаВыплатыДоходов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает налоговую базу за период по юр.\физ.лицу депонента
//
// Параметры:
//  Депонент		 - СправочникСсылка.Контрагенты	 - Депонент
//  КодДохода		 - СправочникСсылка.ДоходыНДФЛ	 - Код дохода (пусто - по всем)
//  МоментВремени	 - МоментВремени				 - МоментВремени документа в пределах года определения базы
// 
// Возвращаемое значение:
//   - Число - Сумма налоговой базы
//
Функция НалоговаяБазаЗаПериод(Депонент, КодДохода, МоментВремени) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(СУММА(НалоговаяБазаВыплатыДоходовОбороты.СуммаДоходаОборот - НалоговаяБазаВыплатыДоходовОбороты.СуммаРасходаОборот), 0) КАК СуммаДохода
	|ИЗ
	|	РегистрНакопления.НалоговаяБазаВыплатыДоходов.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			ЮридическиеФизическиеЛица = &ЮридическиеФизическиеЛица
	|				И ВЫБОР
	|					КОГДА &ПоВсемДоходам
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ КодДохода = &КодДохода
	|				КОНЕЦ) КАК НалоговаяБазаВыплатыДоходовОбороты";
	
	Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица"	, Депонент.ЮридическиеФизическиеЛица);
	Запрос.УстановитьПараметр("ПоВсемДоходам"				, КодДохода = Неопределено);
	Запрос.УстановитьПараметр("КодДохода"					, КодДохода);
	Запрос.УстановитьПараметр("НачалоПериода"				, НачалоГода(МоментВремени.Дата));
	Запрос.УстановитьПараметр("КонецПериода"				, Новый Граница(МоментВремени, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаДохода;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Возвращает сумму остатка округления налога за период по юр.\физ.лицу депонента
//
// Параметры:
//  Депонент		 - СправочникСсылка.Контрагенты	 - Депонент
//  КодДохода		 - СправочникСсылка.ДоходыНДФЛ	 - Код дохода (пусто - по всем)
//  МоментВремени	 - МоментВремени				 - МоментВремени документа в пределах года определения базы
// 
// Возвращаемое значение:
//   - Число - Сумма остатка округления налога
//
Функция СуммаОстаткаОкругленияНалогаЗаПериод(Депонент, КодДохода, МоментВремени) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НалоговаяБазаВыплатыДоходовОбороты.СуммаОкругленияНалогаОборот КАК СуммаОкругленияНалога,
	|	НалоговаяБазаВыплатыДоходовОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.НалоговаяБазаВыплатыДоходов.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ЮридическиеФизическиеЛица = &ЮридическиеФизическиеЛица
	|				И ВЫБОР
	|					КОГДА &ПоВсемДоходам
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ КодДохода = &КодДохода
	|				КОНЕЦ) КАК НалоговаяБазаВыплатыДоходовОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ЮридическиеФизическиеЛица"	, Депонент.ЮридическиеФизическиеЛица);
	Запрос.УстановитьПараметр("ПоВсемДоходам"				, КодДохода = Неопределено);
	Запрос.УстановитьПараметр("КодДохода"					, КодДохода);
	Запрос.УстановитьПараметр("НачалоПериода"				, НачалоГода(МоментВремени.Дата));
	Запрос.УстановитьПараметр("КонецПериода"				, Новый Граница(МоментВремени, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.СуммаОкругленияНалога;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
